In [1]:
import os
import pandas as pd

In [2]:
game_folder = "data/game_data.csv"
time_folder = "data/time_data.csv"
user_folder = "data/user_data.csv"

game_data = pd.read_csv(game_folder)
time_data = pd.read_csv(time_folder)
user_data = pd.read_csv(user_folder)

In [3]:
game_data.head()

   game_id  game_steam_id                      game_name
0        1           4000                    Garry's Mod
1        2            400                         Portal
2        3          20900  The Witcher: Enhanced Edition
3        4          22000                   World of Goo
4        5          17410                  Mirror's Edge

In [4]:
time_data.head()

   user_id  game_id  playtime
0        1        1     80782
1        1        2       637
2        1        3       498
3        1        4       632
4        1        5       396

In [5]:
user_data.head()

   user_id  total_games
0        1          945
1        2         3812
2        3            7
3        4          712
4        5          324

In [6]:
time_data['playtime'] = time_data['playtime'] // 60
time_data.head()

   user_id  game_id  playtime
0        1        1      1346
1        1        2        10
2        1        3         8
3        1        4        10
4        1        5         6